trade_exp/src/Catalogs/Партнеры/Партнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Партнеры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>НашеПредприятие</name>
      <description>Наше предприятие</description>
    </items>
  </predefined>
  <attributes>
    <name>ОсновнойМенеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Пол</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбслуживаетсяТорговымиПредставителями</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВариантОтправкиЭлектронногоЧека</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПрочиеОтношения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Конкурент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ШаблонЭтикетки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БонуснаяПрограммаАктивна</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>МАП</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаАктивацииБонуснойПрограммы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПИН_Код</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a2d8cff6-485d-4179-8e9c-c0e74d4f7704">
    <name>АктивнаяФаза</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4ed10a1b-4743-4b2e-b332-43a49c33d53a">
    <name>ОбъемСтроительства</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6d937f9b-c6c0-400a-a976-e17d07dc2cf4">
    <name>ДатаНачалаАктивнойФазы</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ab7b5f85-1360-48d2-9266-6d9b809fa216">
    <name>НормативПоУмолчанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаПодтвержденияНомераТелефона</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеНомераТелефона</name>
    <type>
      <types>EnumRef.СостояниеНомераТелефона</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодовойОборот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="63694e17-0adb-4a8a-afea-e4e7735edfc1">
    <name>СоглашениеДляРассылок</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bf121ead-3982-46d0-bcce-a08413595a1f">
    <name>Парсинг</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="59343292-e18c-4609-a039-11cc8d8cd93a">
    <name>ВидыНоменклатурыАктивнойФазы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="eeb4daa7-609a-4968-8745-1b6125400c0b">
      <name>ВидНоменклатуры</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6f09dd5d-7de9-4a21-a839-9674c6120b36">
      <name>Коэффициент</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e8a1213f-80cf-4cf1-866d-59ee4fa4ffbe">
      <name>ЭтапСтроительства</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="0daacbf9-aa02-4485-a535-d2d28b00523c">
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="8667b665-ede0-456e-ad08-51f4cf43503a">
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6203050a-d3b4-4e82-89f7-5ad54cf4906b">
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="3b79728c-4ce5-4330-b398-b32f0bb3e6d5">
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b9e943c2-8fad-47c5-b878-66f2576cc609">
      <name>ЗначенияПолей</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2ac6cdc9-f345-456a-9bd8-2e5ae5af6f56">
      <name>Страна</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="6245a898-0f24-4b85-b2d7-89831867e9d9">
      <name>Регион</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="9d10a2ad-841d-4931-902b-83db2a08aaaa">
      <name>Город</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="2acd53d1-e5ab-4fe9-8341-24b714c87f11">
      <name>АдресЭП</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e30e3544-d00d-4269-ac29-88451a763262">
      <name>ДоменноеИмяСервера</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="675d6c69-31a6-49c2-a9b2-cc82f578bbeb">
      <name>НомерТелефона</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="ce03862f-daeb-4d43-a69d-c989cd1f6089">
      <name>НомерТелефонаБезКодов</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="72399ba5-bcbe-40be-b76e-ff36467bc65d">
      <name>ВидДляСписка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="df571c83-e6f9-459f-abbc-6e6053e6eb48">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/InformationRegisters/ИсторияЭтаповСтроительства/ИсторияЭтаповСтроительства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e6aadb4e-eb1c-4690-92fb-4adbc5bd236b">
  <name>ИсторияЭтаповСтроительства</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="fdc8f6ff-0dc4-4e26-8842-262ad1a8ee66">
    <name>ДатаНачалаАктивнойФазы</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="19d84807-8458-48c1-8a70-f242234e3938">
    <name>АктуальныйУТСК</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="990bd464-8d90-4009-9c75-3078a305660b">
    <name>МАП</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="95531fad-505a-42c7-9e8a-b4b776ecdfdb">
    <name>СуммаПоНоменклатуреЗаполнена</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="04749964-27e4-4d04-b1ee-bf8b571ba84a">
    <name>Лид</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="5fe6e58e-8646-4828-9ab4-4f52b9cb144d">
    <name>ЛидЗавершенКакНекачественный</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="2f08ad0e-ba70-4505-b4ce-885b0dca0fc8">
    <name>Сделка</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="581478e6-4ac4-4038-9796-fd6ba6b2d927">
    <name>ПотенциалНаТекущемЭтапе</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="63a9a59b-a2c3-4568-b218-c9fa6eed5c59">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="6293ce71-be3c-4eff-b461-6462f00aa2db">
    <name>ФазаСтроительства</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ИсторияСоставаЭтаповСтроительства/ИсторияСоставаЭтаповСтроительства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="a6ca0cae-bb13-40e5-8be7-c8d28f520f6f">
  <name>ИсторияСоставаЭтаповСтроительства</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="b170975d-7f14-4ae0-b6d0-00a1de93d902">
    <name>Коэффициент</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="c856b9b3-b1e8-48c9-b19d-ed7ebca1b790">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="351ce865-5240-4ee8-9067-e4d4fe8e4db4">
    <name>ФазаСтроительства</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="59cab8b1-fe7d-4ba3-9b20-f8a319460e65">
    <name>ВидНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/ВариантыОтправкиЭлектронногоЧекаПокупателю/ВариантыОтправкиЭлектронногоЧекаПокупателю.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВариантыОтправкиЭлектронногоЧекаПокупателю</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ОтправитьSMS</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НеОтправлять</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтправитьEmail</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Бумажный</name>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Catalogs/Партнеры/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Перем ИзмениласьФаза;
Перем ИзмениласьТЧ;
Перем ИзменилсяМАП;
Перем ИзмениласьДатаАктивнойФазы;
	
&После("ОбработкаПроверкиЗаполнения")
Процедура Док_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	НепроверяемыеРеквизиты = Новый Массив;
	//Этапы строительства+
	ГруппаПартнеров = АльтерраОбщегоНазначения.ПолучитьДополнительныйРеквизит(Ссылка, "Группы партнеров");
	ГруппаПартнеровЭтоЧастныеЛица = ГруппаПартнеров = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Частные лица");
	Если (Не ГруппаПартнеровЭтоЧастныеЛица 
		//И Не Ссылка.Пустая() 
		И НЕ ДатаНачалаАктивнойФазы='00010101') ИЛИ АктивнаяФаза=Справочники.ЭтапыСтроительства.ПустаяСсылка() Тогда
		НепроверяемыеРеквизиты.Добавить("ДатаНачалаАктивнойФазы");
		НепроверяемыеРеквизиты.Добавить("ОбъемСтроительства");
	КонецЕсли;
	//+Этапы строительства
	
	Для каждого Реквизит из НепроверяемыеРеквизиты Цикл 
		НомерРеквизита  = ПроверяемыеРеквизиты.Найти(Реквизит);
		Если НомерРеквизита <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(НомерРеквизита);
		КонецЕсли;
	КонецЦикла;
	
	Если Не Отказ И ГруппаПартнеровЭтоЧастныеЛица И НЕ ЗначениеЗаполнено(ДатаРождения) Тогда
		Если ЭтоНовый() Тогда
			ОбщегоНазначения.СообщитьПользователю("Необходимо заполнить дату рождения!");
			Отказ = Истина;
		Иначе
			ОбщегоНазначения.СообщитьПользователю("У данного клиента не заполнена дата рождения!");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


&После("ПриЗаписи")
Процедура Док_ПриЗаписи(Отказ)
    Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если ЭтотОбъект.ВариантОтправкиЭлектронногоЧека = Перечисления.ВариантыОтправкиЭлектронногоЧекаПокупателю.НеОтправлять
		ИЛИ  ЭтотОбъект.ВариантОтправкиЭлектронногоЧека = Перечисления.ВариантыОтправкиЭлектронногоЧекаПокупателю.ПустаяСсылка() ТОгда 

			ПрисвоитьВариантОтправкиЧека(); 
	КонецЕсли; 
	
	Если Код = "УТ-00000002" и Не РольДоступна("ПолныеПрава") тогда
		Сообщить("Внесение изменений в партнера ""РОЗНИЦА"" запрещено!");
		Отказ = Истина;
	КонецЕсли; 
	ГруппаПартнеров= АльтерраОбщегоНазначения.ПолучитьДополнительныйРеквизит(Ссылка, "Группы партнеров");
	Если Не ЗначениеЗаполнено(ГруппаПартнеров) Тогда
		Сообщить("Необходимо заполнить поле ""Группы партнеров"" на вкладке Дополнительно!");
	КонецЕсли;
	
	//+Альтерра
	Справочники.Партнеры.ЕстьПартнерЧастноеЛицоСТакимТелефоном(Ссылка, Отказ);
	//-
	//-Альтерра
	//АльтерраОбщегоНазначения.ЕстьПартнерСТакимТелефоном(Ссылка, Отказ);
	//-
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Этапы строительства+
	Если Не Отказ Тогда
		Если (ИзмениласьДатаАктивнойФазы ИЛИ ИзмениласьФаза ИЛИ ИзмениласьТЧ ИЛИ ИзменилсяМАП) Тогда
			Если ЗначениеЗаполнено(АктивнаяФаза) Тогда 
				//запись в РС "Этапы строительства"	
				ОтборЗаписей = Новый Структура;
				ОтборЗаписей.Вставить("Партнер",  Ссылка);
				ОтборЗаписей.Вставить("ФазаСтроительства", АктивнаяФаза);
				ПоследняяЗапись = РегистрыСведений.ИсторияЭтаповСтроительства.ПолучитьПоследнее(ТекущаяДата(), ОтборЗаписей);
			КонецЕсли;
			//очистка предыдущих данных по клиенту {
			//НаборЗаписей = РегистрыСведений.ИсторияЭтаповСтроительства.СоздатьНаборЗаписей();
			//НаборЗаписей.Отбор.Партнер.Установить(Ссылка);
			//НаборЗаписей.Очистить();
			//УстановитьПривилегированныйРежим(Истина);
			//НаборЗаписей.Записать(Истина);
			//} очистка предыдущих данных по клиенту 
			Если АктивнаяФаза <> Справочники.ЭтапыСтроительства.ПустаяСсылка() И
				(ПоследняяЗапись.ДатаНачалаАктивнойФазы<>ДатаНачалаАктивнойФазы ИЛИ ПоследняяЗапись.МАП <> МАП ИЛИ 
				//Не ПоследняяЗапись.СуммаПоНоменклатуреЗаполнена И 
				ИзмениласьТЧ) Тогда
				
				//+Альтерра
				Если Константы.ПроцентЗаЭтапСтроительства.Получить()<>0 Тогда
					СозданиеНачисленияБонусныхБаллов(Ссылка);		
				КонецЕсли;	
				//-
				
				ЗаписьОСостоянииПартнера = РегистрыСведений.ИсторияЭтаповСтроительства.СоздатьМенеджерЗаписи();
				
				ЗаполнитьЗначенияСвойств(ЗаписьОСостоянииПартнера, ПоследняяЗапись);
				ЗаписьОСостоянииПартнера.Период = ТекущаяДата();
				ЗаполнитьЗначенияСвойств(ЗаписьОСостоянииПартнера, Ссылка);
				ИзменившийПользователь = Пользователи.ТекущийПользователь();
				Если ЭтоУТСКПользователь(Пользователи.ТекущийПользователь()) Тогда
					ЗаписьОСостоянииПартнера.АктуальныйУТСК = ИзменившийПользователь;
				КонецЕсли;
				ЗаписьОСостоянииПартнера.Партнер = Ссылка;
				ЗаписьОСостоянииПартнера.ФазаСтроительства = АктивнаяФаза;
				Если ЗначениеЗаполнено(МАП) Тогда
					ЗаписьОСостоянииПартнера.СуммаПоНоменклатуреЗаполнена = ПроверитьЗаполненностьТЧВидовНоменклатуры();
				КонецЕсли;
				Если ИзмениласьТЧ Тогда
					ЗаписьОСостоянииПартнера.СуммаПоНоменклатуреЗаполнена = ПроверитьЗаполненностьТЧВидовНоменклатуры();
				КонецЕсли;
				ЗаписьОСостоянииПартнера.ПотенциалНаТекущемЭтапе= АктивнаяФаза.СтроительныйОбъем*Ссылка.ОбъемСтроительства*3600;
				
				ЗаписьОСостоянииПартнера.Записать();
			КонецЕсли;
			
			Если ЗначениеЗаполнено(АктивнаяФаза) И (ИзмениласьФаза ИЛИ ПоследняяЗапись.ДатаНачалаАктивнойФазы<>ДатаНачалаАктивнойФазы) Тогда
				НаборЗаписей= РегистрыСведений.ИсторияСоставаЭтаповСтроительства.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Партнер.Установить(Ссылка);
				НаборЗаписей.Отбор.ФазаСтроительства.Установить(АктивнаяФаза);
				НаборЗаписей.Прочитать();
				Для Каждого стрВидНом Из ВидыНоменклатурыАктивнойФазы Цикл
					Запись= НаборЗаписей.Добавить();	
					Запись.Период= ДатаНачалаАктивнойФазы;
					Запись.Партнер= Ссылка;
					Запись.ФазаСтроительства= АктивнаяФаза;
					Запись.ВидНоменклатуры= стрВидНом.ВидНоменклатуры;
					Запись.Коэффициент= стрВидНом.Коэффициент;
				КонецЦикла;
				Попытка
					НаборЗаписей.Записать(Истина);
				Исключение
				КонецПопытки;
			КонецЕсли;
			
		КонецЕсли;	
	КонецЕсли;
	//+Этапы строительства
	
	мОтветов= Справочники.Партнеры.ПроверитьПоСегментуЗапретОтгрузки(Ссылка);
	Для Каждого Ответ Из мОтветов Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Найден похожий клиент ""%1"" в сегменте ""Запрет отгрузки"" %2", Ответ.Партнер, Ответ.Проверка), Ответ.Партнер);
	КонецЦикла; 
	
	Для каждого СтрокаКИ Из КонтактнаяИнформация Цикл 
		Если СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
			Если НЕ ОбщегоНазначенияКлиентСервер.АдресЭлектроннойПочтыСоответствуетТребованиям(СтрокаКИ.АдресЭП) Тогда 
				Сообщить("Введен некорректный адрес электронной почты");	
			КонецЕсли; 
		КонецЕсли;
	КонецЦикла;
	
	ПрисвоитьСтатусБригадираВПрограммеЛояльности();

	ФИОДобавившего = АльтерраОбщегоНазначения.ПолучитьДополнительныйРеквизит(Ссылка, "ФИО Добавившего"); 
	ДатаДобавления = АльтерраОбщегоНазначения.ПолучитьДополнительныйРеквизит(Ссылка, "Дата добавления"); 
	СвойЧеловекЗначение = АльтерраОбщегоНазначения.ПолучитьДополнительныйРеквизит(Ссылка, "Свой человек"); 
	НеопределеноеЗначение = Дата("01.01.0001 0:00:00");
	
	Запись = РегистрыСведений.СвойЧеловек.СоздатьМенеджерЗаписи();
	Запись.Прочитать();
	Запись.Период = ДатаДобавления;
	Запись.Клиент = ЭтотОбъект.Ссылка;
	Запись.СвойЧеловек = СвойЧеловекЗначение;
	Запись.Ответственный = ФИОДобавившего;
	
	Если Запись.Период <> НеопределеноеЗначение ТОГДА
		Запись.Прочитать(); 	
		Если Запись.Выбран() Тогда
		Иначе
       		НаборЗаписей = РегистрыСведений.СвойЧеловек.СоздатьНаборЗаписей();
       		НаборЗаписей.Прочитать();
       		Запись = НаборЗаписей.Добавить();
       		Запись.Период = ДатаДобавления;
       		Запись.Клиент = ЭтотОбъект.Ссылка;
       		Запись.СвойЧеловек = СвойЧеловекЗначение;
			Запись.Ответственный = ФИОДобавившего;
       		НаборЗаписей.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&После("ПередЗаписью")
Процедура Док_ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;    
	
	//Этапы строительства+
	ИзмениласьФаза  = АктивнаяФаза<>Ссылка.АктивнаяФаза;
	ИзмениласьТЧ = ОбщегоНазначенияУТ.СравнитьТаблицыЗначений(ВидыНоменклатурыАктивнойФазы.Выгрузить(),Ссылка.ВидыНоменклатурыАктивнойФазы.Выгрузить()).Количество()<>0;
	ИзменилсяМАП = МАП <> Ссылка.МАП;
	ИзмениласьДатаАктивнойФазы = ДатаНачалаАктивнойФазы<>Ссылка.ДатаНачалаАктивнойФазы;
	//+Этапы строительства
	
	Если ЭтотОбъект.Предопределенный Тогда
		Если НЕ РольДоступна("ПолныеПрава") Тогда
			Отказ = Истина;
			Сообщить("Недостаточно прав на изменение партнера 'РОЗНИЦА'");
		КонецЕсли;
	КонецЕсли;
	
	///////
	
	ФИОДобавившегоСвойство = АльтерраОбщегоНазначения.ПолучитьСвойствоДопРеквизитаПоЗаголовку("ФИО Добавившего");
	ДатаДобавленияСвойство = АльтерраОбщегоНазначения.ПолучитьСвойствоДопРеквизитаПоЗаголовку("Дата добавления");
	СвойЧеловекСвойство = АльтерраОбщегоНазначения.ПолучитьСвойствоДопРеквизитаПоЗаголовку("Свой человек");
	
	//Значения ДО изменения документа
	ФИОДобавившего = АльтерраОбщегоНазначения.ПолучитьДополнительныйРеквизит(Ссылка, "ФИО Добавившего"); 
	ДатаДобавления = АльтерраОбщегоНазначения.ПолучитьДополнительныйРеквизит(Ссылка, "Дата добавления"); 
	СвойЧеловекЗначение = АльтерраОбщегоНазначения.ПолучитьДополнительныйРеквизит(Ссылка, "Свой человек");
	
	МассивСтрокЧеловек = ЭтотОбъект.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", СвойЧеловекСвойство));
	
	ЕСЛИ МассивСтрокЧеловек.Количество() = 0 ТОГДА
	
    	ЕСЛИ СвойЧеловекЗначение = ИСТИНА ТОГДА

		НайтиИИзменитьДопРеквезит(ЛОЖЬ);
		
    	КонецЕсли;
    	
	Иначе 
		МассивСтрок = МассивСтрокЧеловек[0];

    ЕСЛИ МассивСтрок.Значение = ИСТИНА И СвойЧеловекЗначение = НЕОПРЕДЕЛЕНО ТОГДА

		СтрокаСвойства = ЭтотОбъект.ДополнительныеРеквизиты.Добавить();
		СтрокаСвойства.Значение = Пользователи.ТекущийПользователь();
		СтрокаСвойства.Свойство = ФИОДобавившегоСвойство;

		СтрокаСвойства2 = ЭтотОбъект.ДополнительныеРеквизиты.Добавить();
		СтрокаСвойства2.Значение = ТекущаяДата();
		СтрокаСвойства2.Свойство = ДатаДобавленияСвойство;

        ИначеЕсли (СвойЧеловекЗначение = ЛОЖЬ ИЛИ СвойЧеловекЗначение = НЕОПРЕДЕЛЕНО) И ЗначениеЗаполнено(ФИОДобавившего) Тогда

		НайтиИИзменитьДопРеквезит(ИСТИНА)

	    КонецЕсли;

	КонецЕсли;

КонецПроцедуры

Процедура НайтиИИзменитьДопРеквезит(ЗначениеСвойЧеловек)
	
	ФИОДобавившегоСвойство = АльтерраОбщегоНазначения.ПолучитьСвойствоДопРеквизитаПоЗаголовку("ФИО Добавившего");
	ДатаДобавленияСвойство = АльтерраОбщегоНазначения.ПолучитьСвойствоДопРеквизитаПоЗаголовку("Дата добавления");
	СвойЧеловекСвойство = АльтерраОбщегоНазначения.ПолучитьСвойствоДопРеквизитаПоЗаголовку("Свой человек");
	
	МассивСтрок1 = ЭтотОбъект.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", ФИОДобавившегоСвойство));
	СтрокаСвойства1 = МассивСтрок1[0];
	СтрокаСвойства1.Значение = Пользователи.ТекущийПользователь();
	СтрокаСвойства1.Свойство = ФИОДобавившегоСвойство;

	МассивСтрок2 = ЭтотОбъект.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", ДатаДобавленияСвойство));
	СтрокаСвойства2 = МассивСтрок2[0];
	СтрокаСвойства2.Значение = ТекущаяДата();
	СтрокаСвойства2.Свойство = ДатаДобавленияСвойство;

	СтрокаСвойства3 = ЭтотОбъект.ДополнительныеРеквизиты.Добавить();
	СтрокаСвойства3.Значение = ЗначениеСвойЧеловек;
	СтрокаСвойства3.Свойство = СвойЧеловекСвойство;
	
КонецПроцедуры

Процедура ПрисвоитьВариантОтправкиЧека()  
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	Партнеры.Ссылка КАК Ссылка,
	              |	ПартнерыКонтактнаяИнформация.Представление КАК НомерТелефона,
				  | NULL как Почта
				  |ИЗ
	              |	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
	              |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры КАК Партнеры
	              |		ПО ПартнерыКонтактнаяИнформация.Ссылка = Партнеры.Ссылка
	              |ГДЕ
	              |	ПартнерыКонтактнаяИнформация.Вид.Наименование = ""Телефон""
	              |	И Партнеры.Ссылка = &Ссылка
	              |
	              |ОБЪЕДИНИТЬ ВСЕ
	              |
	              |ВЫБРАТЬ
	              |	Партнеры.Ссылка,
				  | NULL,
	              |	ПартнерыКонтактнаяИнформация.Представление
	              |ИЗ
	              |	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
	              |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры КАК Партнеры
	              |		ПО ПартнерыКонтактнаяИнформация.Ссылка = Партнеры.Ссылка
	              |ГДЕ
	              |	ПартнерыКонтактнаяИнформация.Вид.Наименование = ""Электронная почта""
	              |	И Партнеры.Ссылка = &Ссылка";  
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка); 
	Выборка = Запрос.Выполнить().Выбрать(); 
	Если Выборка.Следующий() Тогда 
		Если ЭтотОбъект.ЮрФизЛицо = Перечисления.КомпанияЧастноеЛицо.Компания Тогда 
			ЭтотОбъект.ВариантОтправкиЭлектронногоЧека = Перечисления.ВариантыОтправкиЭлектронногоЧекаПокупателю.Бумажный;	
		ИначеЕсли Выборка.Почта <> NULL Тогда 
			ЭтотОбъект.ВариантОтправкиЭлектронногоЧека = Перечисления.ВариантыОтправкиЭлектронногоЧекаПокупателю.ОтправитьEmail;
		ИначеЕсли Выборка.НомерТелефона <> NULL Тогда
			ЭтотОбъект.ВариантОтправкиЭлектронногоЧека = Перечисления.ВариантыОтправкиЭлектронногоЧекаПокупателю.ОтправитьSMS;
		Иначе
			ЭтотОбъект.ВариантОтправкиЭлектронногоЧека = Перечисления.ВариантыОтправкиЭлектронногоЧекаПокупателю.Бумажный;
		КонецЕсли; 
		ЭтотОбъект.Записать();
	КонецЕсли; 
	
КонецПроцедуры 

Процедура ПрисвоитьСтатусБригадираВПрограммеЛояльности()
	
	ТекущаяГруппаПартера = Неопределено;
	
	ТекущийСтатусВПрограмме = БонусыАльтерраРезерв.ПолучитьИнформациюПоБаллам(ТекущаяДата(), ЭтотОбъект.Ссылка).Статус;
	ГруппаБригадиров = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Бригадиры", Истина);
	СтатусБригадир = Справочники.СтатусыПартнеровВПрограммеЛояльности_Альтерра.Бригадир;
	СтатусУмелец = Справочники.СтатусыПартнеровВПрограммеЛояльности_Альтерра.Умелец;
	
	ГруппаПартнеров = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "ГруппыПартнеров");
	Отбор = Новый Структура("Свойство", ГруппаПартнеров);
	НайденныеСтрокиОбъект = ЭтотОбъект.ДополнительныеРеквизиты.НайтиСтроки(Отбор);
	
	Если НайденныеСтрокиОбъект.Количество() > 0 Тогда
		ТекущаяГруппаПартнера = НайденныеСтрокиОбъект[0].Значение;
	КонецЕсли;
	
	Если ТекущаяГруппаПартнера = ГруппаБригадиров И ТекущийСтатусВПрограмме <> СтатусБригадир Тогда
		Запись = РегистрыСведений.СтатусыПартнеровВПрограммеЛояльности_Альтерра.СоздатьМенеджерЗаписи();
		Запись.Период = ТекущаяДата();
		Запись.БонуснаяПрограммаЛояльности = АльтерраОбщегоНазначения.ПолучитьБонуснуюПрограмму();
		Запись.Партнер = ЭтотОбъект.Ссылка;
		Запись.Статус = СтатусБригадир;
		Запись.Записать();
	КонецЕсли;
	
	Если ТекущаяГруппаПартнера <> ГруппаБригадиров И ТекущийСтатусВПрограмме = СтатусБригадир Тогда
		Запись = РегистрыСведений.СтатусыПартнеровВПрограммеЛояльности_Альтерра.СоздатьМенеджерЗаписи();
		Запись.Период = ТекущаяДата();
		Запись.БонуснаяПрограммаЛояльности = АльтерраОбщегоНазначения.ПолучитьБонуснуюПрограмму();
		Запись.Партнер = ЭтотОбъект.Ссылка;
		Запись.Статус = СтатусУмелец;
		Запись.Записать();
	КонецЕсли;
	
	
КонецПроцедуры

#Область ЭтапыСтроительства_Вспомогательные

Функция ПолучитьАктуальногоУТСК(Партнер) Экспорт
	ОтборЗаписей = Новый Структура;
	ОтборЗаписей.Вставить("Партнер", Партнер.Ссылка);
	ОтборЗаписей.Вставить("ФазаСтроительства", Партнер.АктивнаяФаза);
	
	Запись = РегистрыСведений.ИсторияЭтаповСтроительства.ПолучитьПоследнее(ТекущаяДата(), ОтборЗаписей);
	Возврат Запись.АктуальныйУТСК;
КонецФункции // ПолучитьАктуальногоУТСК()

Функция ПроверитьЗаполненностьТЧВидовНоменклатуры()
	СуммаПоТаблице = ВидыНоменклатурыАктивнойФазы.Итог("Коэффициент");
	Если СуммаПоТаблице>=АктивнаяФаза.СтроительныйОбъем*ОбъемСтроительства*3600 Тогда
		 Возврат Истина;
	 КонецЕсли;
	 Возврат Ложь;
 КонецФункции // ПроверитьЗаполненностьТЧВидовНоменклатуры()
 
Функция ЭтоУТСКПользователь(Пользователь)
 
 	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГруппыПользователейСостав.Пользователь КАК Пользователь
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
	|		ПО (ГруппыПользователейСостав.Пользователь = Сотрудники.Пользователь)
	|ГДЕ
	|	ГруппыПользователейСостав.Пользователь = &Пользователь
	|	И ГруппыПользователейСостав.Ссылка = &РуководительТСК
	|	И Сотрудники.Должность = &ДолжностьСотрудникаУправляющийТСК
	|	И Сотрудники.Уволен = ЛОЖЬ";
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("РуководительТСК", XMLЗначение(Тип("СправочникСсылка.ГруппыПользователей"), "e8c739cf-b75e-11e9-80dc-002590e168ab"));//Справочники.ГруппыПользователей.НайтиПоНаименованию("Руководитель ТСК"));
	Запрос.УстановитьПараметр("ДолжностьСотрудникаУправляющийТСК", XMLЗначение(Тип("СправочникСсылка.Должности"), "01a2a89c-db5e-11e8-80cf-002590e168ab"));//Справочники.Должности.НайтиПоКоду(000000082));//Управляющий ТСК
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
 
 КонецФункции // ЭтоУТСК()
 
 //+Альтерра
Функция ПолучитьПродажиПартнеровЗаЭтапСтроительства(Партнер, ДатаНачалаАктивнойФазы)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИсторияЭтаповСтроительстваСрезПоследних.Партнер КАК Партнер,
	|	ИсторияЭтаповСтроительстваСрезПоследних.ФазаСтроительства КАК ФазаСтроительства,
	|	ИсторияЭтаповСтроительстваСрезПоследних.ДатаНачалаАктивнойФазы КАК ДатаНачалаАктивнойФазы,
	|	ЕСТЬNULL(ИсторияСоставаЭтаповСтроительства.ВидНоменклатуры, ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ПустаяСсылка)) КАК ВидНоменклатуры
	|ПОМЕСТИТЬ ВТ_ЭтапыСтроительства
	|ИЗ
	|	РегистрСведений.ИсторияЭтаповСтроительства.СрезПоследних(&ТекущаяДата, ФазаСтроительства <> ЗНАЧЕНИЕ(Справочник.ЭтапыСтроительства.ПустаяСсылка) И Партнер = &Партнер) КАК ИсторияЭтаповСтроительстваСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияСоставаЭтаповСтроительства КАК ИсторияСоставаЭтаповСтроительства
	|		ПО ИсторияЭтаповСтроительстваСрезПоследних.Партнер = ИсторияСоставаЭтаповСтроительства.Партнер
	|			И ИсторияЭтаповСтроительстваСрезПоследних.ФазаСтроительства = ИсторияСоставаЭтаповСтроительства.ФазаСтроительства
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АналитикаПоПартнерам.Партнер КАК Партнер,
	|	АналитикаНоменклатуры.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|	СУММА(ВЫБОР
	|			КОГДА &ДанныеОтчета = 1
	|				ТОГДА ТекущийПериодПродажи.СуммаВыручкиОборот
	|			КОГДА &ДанныеОтчета = 2
	|				ТОГДА ТекущийПериодПродажи.СуммаВыручкиБезНДСОборот
	|			КОГДА &ДанныеОтчета = 3
	|				ТОГДА ТекущийПериодПродажи.СуммаВыручкиРеглОборот
	|		КОНЕЦ) КАК СуммаВыручкиТекущийПериод
	|ПОМЕСТИТЬ ВТ_Продажи
	|{ВЫБРАТЬ
	|	Партнер.*,
	|	ВидНоменклатуры.*,
	|	СуммаВыручкиТекущийПериод}
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(&НачалоТекущегоПериода, &ТекущаяДата, Авто, АналитикаУчетаПоПартнерам.Партнер = &Партнер) КАК ТекущийПериодПродажи
	|		{ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК АналитикаПоПартнерам
	|		ПО ТекущийПериодПродажи.АналитикаУчетаПоПартнерам = АналитикаПоПартнерам.Ссылка}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаНоменклатуры
	|		ПО ТекущийПериодПродажи.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.Ссылка}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьТоваров КАК СтоимостьНоменклатуры
	|		ПО ТекущийПериодПродажи.АналитикаУчетаНоменклатуры = СтоимостьНоменклатуры.АналитикаУчетаНоменклатуры
	|			И (АналитикаПоПартнерам.Организация = СтоимостьНоменклатуры.Организация)
	|			И ТекущийПериодПродажи.ВидЗапасов = СтоимостьНоменклатуры.ВидЗапасов
	|			И (СтоимостьНоменклатуры.Период = НАЧАЛОПЕРИОДА(ТекущийПериодПродажи.ПериодМесяц, МЕСЯЦ))}
	|ГДЕ
	|	АналитикаПоПартнерам.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|
	|СГРУППИРОВАТЬ ПО
	|	АналитикаПоПартнерам.Партнер,
	|	АналитикаНоменклатуры.Номенклатура.ВидНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЭтапыСтроительства.Партнер КАК Партнер,
	|	ВТ_ЭтапыСтроительства.ФазаСтроительства КАК ФазаСтроительства,
	|	СУММА(ЕСТЬNULL(ВТ_Продажи.СуммаВыручкиТекущийПериод, 0)) КАК СуммаВыручкиТекущийПериод
	|ИЗ
	|	ВТ_ЭтапыСтроительства КАК ВТ_ЭтапыСтроительства
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Продажи КАК ВТ_Продажи
	|		ПО ВТ_ЭтапыСтроительства.Партнер = ВТ_Продажи.Партнер
	|			И ВТ_ЭтапыСтроительства.ВидНоменклатуры = ВТ_Продажи.ВидНоменклатуры
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ЭтапыСтроительства.Партнер,
	|	ВТ_ЭтапыСтроительства.ФазаСтроительства";
	
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.УстановитьПараметр("НачалоТекущегоПериода", ДатаНачалаАктивнойФазы);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.УстановитьПараметр("ДанныеОтчета", 1);
	
	ПакетРезультатов= Запрос.ВыполнитьПакет();
	
	Возврат ПакетРезультатов
	
КонецФункции

Процедура СозданиеНачисленияБонусныхБаллов(Партнер);
	
	Отказ = Ложь;
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИсторияЭтаповСтроительстваСрезПоследних.ДатаНачалаАктивнойФазы КАК ДатаНачалаАктивнойФазы
	|ИЗ
	|	РегистрСведений.ИсторияЭтаповСтроительства.СрезПоследних(
	|			&ТекущаяДата,
	|			ФазаСтроительства <> ЗНАЧЕНИЕ(Справочник.ЭтапыСтроительства.ПустаяСсылка)
	|				И Партнер = &Партнер) КАК ИсторияЭтаповСтроительстваСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИсторияЭтаповСтроительстваСрезПоследних.Период УБЫВ";
	
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ДатаНачалаАктивнойФазы = ВыборкаДетальныеЗаписи.ДатаНачалаАктивнойФазы;
	Иначе
		Возврат;
	КонецЕсли;	
	
	ПакетРезультатов = ПолучитьПродажиПартнеровЗаЭтапСтроительства(Партнер, ДатаНачалаАктивнойФазы);
	
	НачатьТранзакцию();
	Попытка
	
		Выборка= ПакетРезультатов[2].Выбрать();
		Пока Выборка.Следующий() Цикл

			ДокНачисленияБаллов = Документы.НачислениеИСписаниеБонусныхБаллов.СоздатьДокумент();
			ДокНачисленияБаллов.Дата = ТекущаяДатаСеанса();
		    ДокНачисленияБаллов.БонуснаяПрограммаЛояльности = Справочники.БонусныеПрограммыЛояльности.НайтиПоНаименованию("Бонус от ALTERRA");
			ДокНачисленияБаллов.Причина = Справочники.ПричиныНачисленияБонусныхБаллов.НайтиПоНаименованию("За этап строительства");
			ДокНачисленияБаллов.Комментарий = "Начислено за этап строительства: " + Выборка.ФазаСтроительства;
			ДокНачисленияБаллов.ВидПравила = Перечисления.ВидыПравилНачисленияБонусныхБаллов.Начисление;
			ДокНачисленияБаллов.ПериодДействия = Перечисления.Периодичность.Месяц;
			ДокНачисленияБаллов.ПериодОтсрочкиНачалаДействия = Перечисления.Периодичность.День;
			
			СтрокаНачисления = ДокНачисленияБаллов.Начисление.Добавить();
			СтрокаНачисления.Партнер = Выборка.Партнер;
			ПроцентЗаЭтапСтроительства = Константы.ПроцентЗаЭтапСтроительства.Получить();
			СтрокаНачисления.Баллы = 0.01 * Выборка.СуммаВыручкиТекущийПериод * ПроцентЗаЭтапСтроительства;
			
			ДокНачисленияБаллов.Записать(РежимЗаписиДокумента.Проведение);
		КонецЦикла;
		
	Исключение
		Отказ = Истина;
		//Сообщить(ИнформацияОбОшибке().Описание);
	КонецПопытки;
	
	Если Отказ Тогда 
		//Сообщить("Ошибка! Тразнакция отменена.", СтатусСообщения.ОченьВажное);
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
//-
 
#КонецОбласти

#КонецЕсли
